apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_ethernet.c
#define MII_BIG_TIMEOUT      666666

/* These definitions are used to remember the speed/duplex settings */

#define LPC17_40_SPEED_MASK     0x01
#define LPC17_40_SPEED_100      0x01
#define LPC17_40_SPEED_10       0x00

#define LPC17_40_DUPLEX_MASK    0x02
#define LPC17_40_DUPLEX_FULL    0x02
#define LPC17_40_DUPLEX_HALF    0x00

#define LPC17_40_10BASET_HD     (LPC17_40_SPEED_10  | LPC17_40_DUPLEX_HALF)
#define LPC17_40_10BASET_FD     (LPC17_40_SPEED_10  | LPC17_40_DUPLEX_FULL)
#define LPC17_40_100BASET_HD    (LPC17_40_SPEED_100 | LPC17_40_DUPLEX_HALF)
#define LPC17_40_100BASET_FD    (LPC17_40_SPEED_100 | LPC17_40_DUPLEX_FULL)

#ifdef CONFIG_LPC17_40_PHY_SPEED100
#  ifdef CONFIG_LPC17_40_PHY_FDUPLEX
#    define LPC17_40_MODE_DEFLT LPC17_40_100BASET_FD
#  else
#    define LPC17_40_MODE_DEFLT LPC17_40_100BASET_HD
#  endif
#else
#  ifdef CONFIG_LPC17_40_PHY_FDUPLEX
#    define LPC17_40_MODE_DEFLT LPC17_40_10BASET_FD
#  else
#    define LPC17_40_MODE_DEFLT LPC17_40_10BASET_HD
#  endif
#endif

#if defined(CONFIG_NETDEV_PHY_IOCTL) && defined(CONFIG_ARCH_PHY_INTERRUPT)
#  if defined( CONFIG_ETH0_PHY_AM79C874)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_KS8721)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_KSZ8041)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_KSZ8051)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_KSZ8061)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_KSZ8081)
#    define MII_INT_REG    MII_KSZ8081_INT
#    define MII_INT_SETEN  MII_KSZ80x1_INT_LDEN | MII_KSZ80x1_INT_LUEN
#    define MII_INT_CLREN  0
#  elif defined( CONFIG_ETH0_PHY_KSZ90x1)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_DP83848C)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_LAN8720)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_LAN8740)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_LAN8740A)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_LAN8742A)
#    error missing logic
#  elif defined( CONFIG_ETH0_PHY_DM9161)
#    error missing logic
#  else
#    error unknown PHY
#  endif
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The lpc17_40_driver_s encapsulates all state information for a single
 * hardware interface
 */

struct lpc17_40_driver_s
{
  /* The following fields would only be necessary on chips that support
   * multiple Ethernet controllers.
   */

#if CONFIG_LPC17_40_NINTERFACES > 1
  uint32_t lp_base;             /* Ethernet controller base address */
  int      lp_irq;              /* Ethernet controller IRQ */
#endif

  bool     lp_ifup;             /* true:ifup false:ifdown */
  bool     lp_mode;             /* speed/duplex */
  bool     lp_txpending;        /* There is a pending Tx in lp_dev */
#ifdef LPC17_40_HAVE_PHY
  uint8_t  lp_phyaddr;          /* PHY device address */
#endif
  uint32_t lp_inten;            /* Shadow copy of INTEN register */
  struct wdog_s lp_txtimeout;   /* TX timeout timer */

  struct work_s lp_txwork;      /* TX work continuation */
  struct work_s lp_rxwork;      /* RX work continuation */
  struct work_s lp_pollwork;    /* Poll work continuation */
  uint32_t status;

  /* This holds the information visible to the NuttX networking layer */

  struct net_driver_s lp_dev;  /* Interface understood by the network layer */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* A single packet buffer per interface is used */

static uint8_t g_pktbuf[CONFIG_LPC17_40_NINTERFACES][PKTBUF_SIZE];

/* Array of ethernet driver status structures */

static struct lpc17_40_driver_s g_ethdrvr[CONFIG_LPC17_40_NINTERFACES];

/* ENET pins are on P1[0,1,4,6,8,9,10,14,15] + MDC on P1[16] or P2[8] and
 * MDIO on P1[17] or P2[9].  The board.h file will define GPIO_ENET_MDC and
 * PGIO_ENET_MDIO to selec which pin setting to use.
 *
 * On older Rev '-' devices, P1[6] ENET-TX_CLK would also have be to
 * configured.
 */

static const uint16_t g_enetpins[GPIO_NENET_PINS] =
{
  GPIO_ENET_TXD0, GPIO_ENET_TXD1, GPIO_ENET_TXEN, GPIO_ENET_CRS,
  GPIO_ENET_RXD0, GPIO_ENET_RXD1, GPIO_ENET_RXER, GPIO_ENET_REFCLK,
  GPIO_ENET_MDC, GPIO_ENET_MDIO
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations */

#ifdef CONFIG_LPC17_40_NET_REGDEBUG
static void lpc17_40_printreg(uint32_t addr, uint32_t val, bool iswrite);
static void lpc17_40_checkreg(uint32_t addr, uint32_t val, bool iswrite);
static uint32_t lpc17_40_getreg(uint32_t addr);
static void lpc17_40_putreg(uint32_t val, uint32_t addr);
#else
#  define lpc17_40_getreg(addr)     getreg32(addr)
#  define lpc17_40_putreg(val,addr) putreg32(val,addr)
#endif

/* Common TX logic */

static int  lpc17_40_txdesc(struct lpc17_40_driver_s *priv);
static int  lpc17_40_transmit(struct lpc17_40_driver_s *priv);
static int  lpc17_40_txpoll(struct net_driver_s *dev);

/* Interrupt handling */

static void lpc17_40_response(struct lpc17_40_driver_s *priv);

static void lpc17_40_txdone_work(void *arg);
static void lpc17_40_rxdone_work(void *arg);
static int  lpc17_40_interrupt(int irq, void *context, void *arg);

/* Watchdog timer expirations */

static void lpc17_40_txtimeout_work(void *arg);
static void lpc17_40_txtimeout_expiry(wdparm_t arg);

/* NuttX callback functions */

static int lpc17_40_ifup(struct net_driver_s *dev);
static int lpc17_40_ifdown(struct net_driver_s *dev);

static void lpc17_40_txavail_work(void *arg);
static int lpc17_40_txavail(struct net_driver_s *dev);

#if defined(CONFIG_NET_MCASTGROUP) || defined(CONFIG_NET_ICMPv6)
static uint32_t lpc17_40_calcethcrc(const uint8_t *data, size_t length);
static int lpc17_40_addmac(struct net_driver_s *dev, const uint8_t *mac);
#endif
#ifdef CONFIG_NET_MCASTGROUP
static int lpc17_40_rmmac(struct net_driver_s *dev, const uint8_t *mac);
#endif

