apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_ethernet.c
  DEBUGASSERT(priv);
  DEBUGASSERT(lpc17_40_txdesc(priv) == OK);

  /* Check if there is a pending Tx transfer that was scheduled by Rx
   * handling while the Tx logic was busy.  If so, processing that pending
   * Tx now.
   */

  net_lock();
  if (priv->lp_txpending)
    {
      /* Clear the pending condition, send the packet,
       * and restore Rx interrupts
       */

      priv->lp_txpending = false;

      lpc17_40_transmit(priv);

      priv->lp_inten |= ETH_RXINTS;
      lpc17_40_putreg(priv->lp_inten, LPC17_40_ETH_INTEN);
    }

  /* Otherwise poll the network layer for new XMIT data */

  else
    {
      devif_poll(&priv->lp_dev, lpc17_40_txpoll);
    }

  net_unlock();
}

/****************************************************************************
 * Function: lpc17_40_interrupt
 *
 * Description:
 *   Hardware interrupt handler
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (architecture-specific)
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *
 ****************************************************************************/

static int lpc17_40_interrupt(int irq, void *context, void *arg)
{
  register struct lpc17_40_driver_s *priv;
  uint32_t status;

#if CONFIG_LPC17_40_NINTERFACES > 1
# error "A mechanism to associate and interface with an IRQ is needed"
#else
  priv = &g_ethdrvr[0];
#endif

  /* Get the interrupt status (zero means no interrupts pending). */

  status = lpc17_40_getreg(LPC17_40_ETH_INTST);
  if (status != 0)
    {
      /* Clear all pending interrupts */

      lpc17_40_putreg(status, LPC17_40_ETH_INTCLR);

      /* Handle each pending interrupt **************************************/

      /* Check for Wake-Up on Lan *******************************************/

#ifdef CONFIG_LPC17_40_ETH_WOL
      if ((status & ETH_INT_WKUP) != 0)
        {
#         warning "Missing logic"
        }
      else
#endif
      /* Fatal Errors *******************************************************/

      /* RX OVERRUN -- Fatal overrun error in the receive queue. The fatal
       * interrupt should be resolved by a Rx soft-reset. The bit is not
       * set when there is a nonfatal overrun error.
       *
       * TX UNDERRUN -- Interrupt set on a fatal underrun error in the
       * transmit queue. The fatal interrupt should be resolved by a Tx
       * soft-reset. The bit is not set when there is a nonfatal underrun
       * error.
       */

      if ((status & (ETH_INT_RXOVR | ETH_INT_TXUNR)) != 0)
        {
          if ((status & ETH_INT_RXOVR) != 0)
            {
              nerr("ERROR: RX Overrun. status: %08" PRIx32 "\n", status);
              NETDEV_RXERRORS(&priv->lp_dev);
            }

          if ((status & ETH_INT_TXUNR) != 0)
            {
              nerr("ERROR: TX Underrun. status: %08" PRIx32 "\n", status);
              NETDEV_TXERRORS(&priv->lp_dev);
            }

          /* ifup() will reset the EMAC and bring it back up */

           lpc17_40_ifup(&priv->lp_dev);
        }
      else
        {
          /* Check for receive events ***************************************/

          /* RX ERROR -- Triggered on receive errors: AlignmentError,
           * RangeError, LengthError, SymbolError, CRCError or NoDescriptor
           * or Overrun.  NOTE:  (1) We will still need to call
           * lpc17_40_rxdone_process on RX errors to bump the considx over
           * the bad packet.  (2) The DMA engine reports bogus length
           * errors, making this a pretty useless (as well as annoying)
           * check anyway.
           */

          if ((status & ETH_INT_RXERR) != 0)
            {
              nerr("ERROR: RX ERROR: status: %08" PRIx32 "\n", status);
              NETDEV_RXERRORS(&priv->lp_dev);
            }

          /* RX FINISHED -- Triggered when all receive descriptors have
           * been processed i.e. on the transition to the situation
           * where ProduceIndex == ConsumeIndex.
           *
           * Treated as INT_RX_DONE if ProduceIndex != ConsumeIndex so the
           * packets are processed anyway.
           *
           * RX DONE -- Triggered when a receive descriptor has been
           * processed while the Interrupt bit in the Control field of
           * the descriptor was set.
           */

          if ((status & ETH_INT_RXFIN) != 0 ||
              (status & ETH_INT_RXDONE) != 0)
            {
              /* We have received at least one new incoming packet.
               * Disable further TX interrupts for now.  TX interrupts will
               * be re-enabled after the work has been processed.
               */

              priv->lp_inten &= ~ETH_RXINTS;
              lpc17_40_putreg(priv->lp_inten, LPC17_40_ETH_INTEN);

              /* Schedule RX-related work to be performed on the work thread,
               * perhaps cancelling any pending RX work.
               */

              work_queue(ETHWORK, &priv->lp_rxwork,
                         lpc17_40_rxdone_work, priv, 0);
            }

          /* Check for Tx events ********************************************/

          /* TX ERROR -- Triggered on transmit errors: LateCollision,
           * ExcessiveCollision and ExcessiveDefer, NoDescriptor or Underrun.
           * NOTE: We will still need to call lpc17_40_txdone_process() in
           * order to clean up after the failed transmit.
           */

          if ((status & ETH_INT_TXERR) != 0)
            {
              nerr("ERROR: TX ERROR: status: %08" PRIx32 "\n", status);
              NETDEV_TXERRORS(&priv->lp_dev);
            }

#if 0
          /* TX FINISHED -- Triggered when all transmit descriptors have
           * been processed i.e. on the transition to the situation
           * where ProduceIndex == ConsumeIndex.
           */

          if ((status & ETH_INT_TXFIN) != 0)
            {
            }
#endif

          /* TX DONE -- Triggered when a descriptor has been transmitted
           * while the Interrupt bit in the Control field of the
           * descriptor was set.
           */

          if ((status & ETH_INT_TXDONE) != 0)
            {
              NETDEV_TXDONE(&priv->lp_dev);

              /* A packet transmission just completed.
               * Cancel the pending Tx timeout
               */

              wd_cancel(&priv->lp_txtimeout);

