apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_ethernet.c
              /* Disable further Tx interrupts.  Tx interrupts may be
               * re-enabled again depending upon the actions of
               * lpc17_40_txdone_process()
               */

              priv->lp_inten &= ~ETH_TXINTS;
              lpc17_40_putreg(priv->lp_inten, LPC17_40_ETH_INTEN);

              /* Cancel any pending TX done work (to prevent overruns and
               * also to avoid race conditions with the TX timeout work)
               */

              work_cancel(ETHWORK, &priv->lp_txwork);

              /* Schedule TX-related work to be performed on the work thread,
               * perhaps cancelling any pending TX work.
               */

              work_queue(ETHWORK, &priv->lp_txwork,
                         lpc17_40_txdone_work, priv, 0);
            }
        }
    }

  /* Clear the pending interrupt */

#if 0 /* Apparently not necessary */
#  if CONFIG_LPC17_40_NINTERFACES > 1
  lpc17_40_clrpend(priv->irq);
#  else
  lpc17_40_clrpend(LPC17_40_IRQ_ETH);
#  endif
#endif

  return OK;
}

/****************************************************************************
 * Function: lpc17_40_txtimeout_work
 *
 * Description:
 *   Perform TX timeout related work from the worker thread
 *
 * Input Parameters:
 *   arg - The argument passed when work_queue() as called.
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *   Ethernet interrupts are disabled
 *
 ****************************************************************************/

static void lpc17_40_txtimeout_work(void *arg)
{
  struct lpc17_40_driver_s *priv = (struct lpc17_40_driver_s *)arg;

  /* Increment statistics and dump debug info */

  net_lock();
  NETDEV_TXTIMEOUTS(&priv->lp_dev);
  if (priv->lp_ifup)
    {
      /* Then reset the hardware. ifup() will reset the interface, then bring
       * it back up.
       */

      lpc17_40_ifup(&priv->lp_dev);

      /* Then poll the network layer for new XMIT data */

      devif_poll(&priv->lp_dev, lpc17_40_txpoll);
    }

  net_unlock();
}

/****************************************************************************
 * Function: lpc17_40_txtimeout_expiry
 *
 * Description:
 *   Our TX watchdog timed out.  Called from the timer interrupt handler.
 *   The last TX never completed.  Reset the hardware and start again.
 *
 * Input Parameters:
 *   arg  - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Global interrupts are disabled by the watchdog logic.
 *
 ****************************************************************************/

static void lpc17_40_txtimeout_expiry(wdparm_t arg)
{
  struct lpc17_40_driver_s *priv = (struct lpc17_40_driver_s *)arg;

  /* Disable further Tx interrupts.  Tx interrupts may be re-enabled again
   * depending upon the actions of lpc17_40_poll_process()
   */

  priv->lp_inten &= ~ETH_TXINTS;
  lpc17_40_putreg(priv->lp_inten, LPC17_40_ETH_INTEN);

  /* Is the single TX work structure available?  If not, then there is
   * pending TX work to be done this must be a false alarm TX timeout.
   */

  if (work_available(&priv->lp_txwork))
    {
      /* Schedule to perform the interrupt processing on the worker thread. */

      work_queue(ETHWORK, &priv->lp_txwork, lpc17_40_txtimeout_work,
                 priv, 0);
    }
}

/****************************************************************************
 * Function: lpc17_40_ifup
 *
 * Description:
 *   NuttX Callback: Bring up the Ethernet interface when an IP address is
 *   provided
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int lpc17_40_ifup(struct net_driver_s *dev)
{
  struct lpc17_40_driver_s *priv =
    (struct lpc17_40_driver_s *)dev->d_private;
  uint32_t regval;
  int ret;

  ninfo("Bringing up: %u.%u.%u.%u\n",
        ip4_addr1(dev->d_ipaddr), ip4_addr2(dev->d_ipaddr),
        ip4_addr3(dev->d_ipaddr), ip4_addr4(dev->d_ipaddr));

  /* Reset the Ethernet controller (again) */

  lpc17_40_ethreset(priv);

  /* Initialize the PHY and wait for the link to be established */

  ret = lpc17_40_phyinit(priv);
  if (ret != 0)
    {
      nerr("ERROR: lpc17_40_phyinit failed: %d\n", ret);
      return ret;
    }

  /* Configure the MAC station address */

  regval = (uint32_t)priv->lp_dev.d_mac.ether.ether_addr_octet[5] << 8 |
           (uint32_t)priv->lp_dev.d_mac.ether.ether_addr_octet[4];
  lpc17_40_putreg(regval, LPC17_40_ETH_SA0);

  regval = (uint32_t)priv->lp_dev.d_mac.ether.ether_addr_octet[3] << 8 |
           (uint32_t)priv->lp_dev.d_mac.ether.ether_addr_octet[2];
  lpc17_40_putreg(regval, LPC17_40_ETH_SA1);

  regval = (uint32_t)priv->lp_dev.d_mac.ether.ether_addr_octet[1] << 8 |
           (uint32_t)priv->lp_dev.d_mac.ether.ether_addr_octet[0];
  lpc17_40_putreg(regval, LPC17_40_ETH_SA2);

  /* Initialize Ethernet interface for the PHY setup */

  lpc17_40_macmode(priv->lp_mode);

  /* Initialize EMAC DMA memory --
   * descriptors, status, packet buffers, etc.
   */

  lpc17_40_txdescinit(priv);
  lpc17_40_rxdescinit(priv);

  /* Configure to pass all received frames */

  regval = lpc17_40_getreg(LPC17_40_ETH_MAC1);
  regval |= ETH_MAC1_PARF;
  lpc17_40_putreg(regval, LPC17_40_ETH_MAC1);

  /* Set up RX filter and configure to accept broadcast addresses, multicast
   * addresses, and perfect station address matches.  We should also accept
   * perfect matches and, most likely, broadcast (for example, for ARP
   * requests).  Other RX filter options will only be enabled if so
   * selected.  NOTE: There is a selection CONFIG_NET_BROADCAST, but this
   * enables receipt of UDP broadcast packets inside of the stack.
   */

  regval = ETH_RXFLCTRL_PERFEN | ETH_RXFLCTRL_BCASTEN;
#ifdef CONFIG_LPC17_40_MULTICAST
  regval |= (ETH_RXFLCTRL_MCASTEN | ETH_RXFLCTRL_UCASTEN);
#endif
#ifdef CONFIG_LPC17_40_ETH_HASH
  regval |= (ETH_RXFLCTRL_MCASTHASHEN | ETH_RXFLCTRL_UCASTHASHEN);
#endif
  lpc17_40_putreg(regval, LPC17_40_ETH_RXFLCTRL);

  /* Clear any pending interrupts (shouldn't be any) */

  lpc17_40_putreg(0xffffffff, LPC17_40_ETH_INTCLR);

  /* Enable Ethernet interrupts.  The way we do this depends on whether or
   * not Wakeup on Lan (WoL) has been configured.
   */

