apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_ethernet.c
#ifdef CONFIG_LPC17_40_ETH_WOL
  /* Configure WoL: Clear all receive filter WoLs and enable the perfect
   * match WoL interrupt.  We will wait until the Wake-up to finish
   * bringing things up.
   */

  lpc17_40_putreg(0xffffffff, LPC17_40_ETH_RXFLWOLCLR);
  lpc17_40_putreg(ETH_RXFLCTRL_RXFILEN, LPC17_40_ETH_RXFLCTRL);

  priv->lp_inten = ETH_INT_WKUP;
  lpc17_40_putreg(ETH_INT_WKUP, LPC17_40_ETH_INTEN);
#else
  /* Otherwise, enable all Rx interrupts.  Tx interrupts, SOFTINT and WoL are
   * excluded.  Tx interrupts will not be enabled until there is data to be
   * sent.
   */

  priv->lp_inten = ETH_RXINTS;
  lpc17_40_putreg(ETH_RXINTS, LPC17_40_ETH_INTEN);
#endif

  /* Enable Rx. "Enabling of the receive function is located in two places.
   * The receive DMA manager needs to be enabled and the receive data path
   * of the MAC needs to be enabled. To prevent overflow in the receive
   * DMA engine the receive DMA engine should be enabled by setting the
   * RxEnable bit in the Command register before enabling the receive data
   * path in the MAC by setting the RECEIVE ENABLE bit in the MAC1 register."
   */

  regval  = lpc17_40_getreg(LPC17_40_ETH_CMD);
  regval |= ETH_CMD_RXEN;
  lpc17_40_putreg(regval, LPC17_40_ETH_CMD);

  regval  = lpc17_40_getreg(LPC17_40_ETH_MAC1);
  regval |= ETH_MAC1_RE;
  lpc17_40_putreg(regval, LPC17_40_ETH_MAC1);

  /* Enable Tx */

  regval  = lpc17_40_getreg(LPC17_40_ETH_CMD);
  regval |= ETH_CMD_TXEN;
  lpc17_40_putreg(regval, LPC17_40_ETH_CMD);

  /* Finally, make the interface up and enable the Ethernet interrupt at
   * the interrupt controller
   */

  priv->lp_ifup = true;
#if CONFIG_LPC17_40_NINTERFACES > 1
  up_enable_irq(priv->irq);
#else
  up_enable_irq(LPC17_40_IRQ_ETH);
#endif

  netdev_carrier_on(dev);

  return OK;
}

/****************************************************************************
 * Function: lpc17_40_ifdown
 *
 * Description:
 *   NuttX Callback: Stop the interface.
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int lpc17_40_ifdown(struct net_driver_s *dev)
{
  struct lpc17_40_driver_s *priv =
    (struct lpc17_40_driver_s *)dev->d_private;
  irqstate_t flags;

  /* Disable the Ethernet interrupt */

  flags = enter_critical_section();
  up_disable_irq(LPC17_40_IRQ_ETH);

  /* Cancel the TX timeout timers */

  wd_cancel(&priv->lp_txtimeout);

  /* Reset the device and mark it as down. */

  lpc17_40_ethreset(priv);
  priv->lp_ifup = false;
  leave_critical_section(flags);

  netdev_carrier_off(dev);

  return OK;
}

/****************************************************************************
 * Function: lpc17_40_txavail_work
 *
 * Description:
 *   Perform an out-of-cycle poll on the worker thread.
 *
 * Input Parameters:
 *   arg - Reference to the NuttX driver state structure (cast to void*)
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called on the higher priority worker thread.
 *
 ****************************************************************************/

static void lpc17_40_txavail_work(void *arg)
{
  struct lpc17_40_driver_s *priv = (struct lpc17_40_driver_s *)arg;

  /* Ignore the notification if the interface is not yet up */

  net_lock();
  if (priv->lp_ifup)
    {
      /* Check if there is room in the hardware to hold another packet. */

      if (lpc17_40_txdesc(priv) == OK)
        {
          /* If so, then poll the network layer for new XMIT data */

          devif_poll(&priv->lp_dev, lpc17_40_txpoll);
        }
    }

  net_unlock();
}

/****************************************************************************
 * Function: lpc17_40_txavail
 *
 * Description:
 *   Driver callback invoked when new TX data is available.  This is a
 *   stimulus perform an out-of-cycle poll and, thereby, reduce the TX
 *   latency.
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called in normal user mode
 *
 ****************************************************************************/

static int lpc17_40_txavail(struct net_driver_s *dev)
{
  struct lpc17_40_driver_s *priv =
    (struct lpc17_40_driver_s *)dev->d_private;

  /* Is our single poll work structure available?  It may not be if there
   * are pending polling actions and we will have to ignore the Tx
   * availability action (which is okay because all poll actions have,
   * ultimately, the same effect.
   */

  if (work_available(&priv->lp_pollwork))
    {
      /* Schedule to serialize the poll on the worker thread. */

      work_queue(ETHWORK, &priv->lp_pollwork, lpc17_40_txavail_work,
                 priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Function: lpc17_40_calcethcrc
 *
 * Description:
 *   Function to calculate the CRC used by LPC17 to check an Ethernet frame
 *
 *   Algorithm adapted from LPC17xx sample code that contains this notice:
 *
 *     Software that is described herein is for illustrative purposes only
 *     which provides customers with programming information regarding the
 *     products. This software is supplied "AS IS" without any warranties.
 *     NXP Semiconductors assumes no responsibility or liability for the
 *     use of the software, conveys no license or title under any patent,
 *     copyright, or mask work right to the product. NXP Semiconductors
 *     reserves the right to make changes in the software without
 *     notification. NXP Semiconductors also make no representation or
 *     warranty that such application will be suitable for the specified
 *     use without further testing or modification.
 *
 * Input Parameters:
 *   data   - the data to be checked
 *   length - length of the data
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

