apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_ethernet.c
  lpc17_40_putreg(ETH_CMD_RMII, LPC17_40_ETH_CMD);
  lpc17_40_putreg(ETH_SUPP_SPEED, LPC17_40_ETH_SUPP);

  /* Find PHY Address.  Because the controller has a pull-up and the
   * PHY has pull-down resistors on RXD lines some times the PHY
   * latches different at different addresses.
   */

  for (phyaddr = 0; phyaddr < 32; phyaddr++)
    {
      /* Check if we can see the selected device ID at this
       * PHY address.
       */

      phyreg = (unsigned int)lpc17_40_phyread(phyaddr, MII_PHYID1);
      ninfo("Addr: %d PHY ID1: %04x\n", phyaddr, phyreg);

      /* Compare OUI bits 3-18 */

      if (phyreg == LPC17_40_PHYID1)
        {
          phyreg = lpc17_40_phyread(phyaddr, MII_PHYID2);
          ninfo("Addr: %d PHY ID2: %04x\n", phyaddr, phyreg);

          /* Compare OUI bits 19-24 and the 6-bit model number (ignoring the
           * 4-bit revision number).
           */

          if ((phyreg & 0xfff0) == (LPC17_40_PHYID2 & 0xfff0))
            {
              break;
            }
        }
    }

  /* Check if the PHY device address was found */

  if (phyaddr > 31)
    {
      /* Failed to find PHY at any location */

      nerr("ERROR: No PHY detected\n");
      return -ENODEV;
    }

  ninfo("phyaddr: %d\n", phyaddr);

  /* Save the discovered PHY device address */

  priv->lp_phyaddr = phyaddr;

  /* Reset the PHY */

  ret = lpc17_40_phyreset(phyaddr);
  if (ret < 0)
    {
      return ret;
    }

  lpc17_40_showmii(phyaddr, "After reset");

  /* Check for preamble suppression support */

  phyreg = lpc17_40_phyread(phyaddr, MII_MSR);
  if ((phyreg & MII_MSR_MFRAMESUPPRESS) != 0)
    {
      /* The PHY supports preamble suppression */

      regval  = lpc17_40_getreg(LPC17_40_ETH_MCFG);
      regval |= ETH_MCFG_SUPPRE;
      lpc17_40_putreg(regval, LPC17_40_ETH_MCFG);
    }

#if defined(CONFIG_ETH0_PHY_DP83848C)
  /* Enable the RMII interface for DP83848x PHYs */

  lpc17_40_phywrite(phyaddr, MII_DP83848C_RBR,
                    MII_RBR_ELAST_2 | MII_RBR_RMIIMODE);
#endif

  /* Are we configured to do auto-negotiation? */

#ifdef CONFIG_LPC17_40_PHY_AUTONEG
  /* Enable FD mode, Auto-negotiation and 100Mbps speed */

  lpc17_40_phywrite(phyaddr, MII_MCR,
                    MII_MCR_FULLDPLX | MII_MCR_ANENABLE | MII_MCR_SPEED100);

  /* Setup the Auto-negotiation advertisement: 100 or 10, and HD or FD */

  lpc17_40_phywrite(phyaddr, MII_ADVERTISE,
                 (MII_ADVERTISE_100BASETXFULL | MII_ADVERTISE_100BASETXHALF |
                  MII_ADVERTISE_10BASETXFULL  | MII_ADVERTISE_10BASETXHALF  |
                  MII_ADVERTISE_CSMA));

  /* Then perform the auto-negotiation */

  ret = lpc17_40_phyautoneg(phyaddr);
  if (ret < 0)
    {
      return ret;
    }
#else
  /* Set up the fixed PHY configuration */

  ret = lpc17_40_phymode(phyaddr, LPC17_40_MODE_DEFLT);
  if (ret < 0)
    {
      return ret;
    }
#endif

#if defined(CONFIG_ETH0_PHY_DP83848C)
  /* Wait until the link is established */

  while ((lpc17_40_phyread(phyaddr, MII_DP83848C_STS) & 0x0001) == 0)
    {
      nxsched_usleep(40000);
    }
#endif

  /* The link is established */

  lpc17_40_showmii(phyaddr, "After link established");

  /* Check configuration */

#if defined(CONFIG_ETH0_PHY_KS8721)
  phyreg = lpc17_40_phyread(phyaddr, MII_KS8721_10BTCR);

  switch (phyreg & KS8721_10BTCR_MODE_MASK)
    {
      case KS8721_10BTCR_MODE_10BTHD:  /* 10BASE-T half duplex */
        priv->lp_mode = LPC17_40_10BASET_HD;
        lpc17_40_putreg(0, LPC17_40_ETH_SUPP);
        break;

      case KS8721_10BTCR_MODE_100BTHD: /* 100BASE-T half duplex */
        priv->lp_mode = LPC17_40_100BASET_HD;
        break;

      case KS8721_10BTCR_MODE_10BTFD: /* 10BASE-T full duplex */
        priv->lp_mode = LPC17_40_10BASET_FD;
        lpc17_40_putreg(0, LPC17_40_ETH_SUPP);
        break;

      case KS8721_10BTCR_MODE_100BTFD: /* 100BASE-T full duplex */
        priv->lp_mode = LPC17_40_100BASET_FD;
        break;

      default:
        nerr("ERROR: Unrecognized mode: %04x\n", phyreg);
        return -ENODEV;
    }

#elif defined(CONFIG_ETH0_PHY_KSZ8041)
  phyreg = lpc17_40_phyread(phyaddr, MII_KSZ8041_PHYCTRL2);

  switch (phyreg & MII_PHYCTRL2_MODE_MASK)
    {
      case MII_PHYCTRL2_MODE_10HDX:  /* 10BASE-T half duplex */
        priv->lp_mode = LPC17_40_10BASET_HD;
        lpc17_40_putreg(0, LPC17_40_ETH_SUPP);
        break;

      case MII_PHYCTRL2_MODE_100HDX: /* 100BASE-T half duplex */
        priv->lp_mode = LPC17_40_100BASET_HD;
        break;

      case MII_PHYCTRL2_MODE_10FDX: /* 10BASE-T full duplex */
        priv->lp_mode = LPC17_40_10BASET_FD;
        lpc17_40_putreg(0, LPC17_40_ETH_SUPP);
        break;

      case MII_PHYCTRL2_MODE_100FDX: /* 100BASE-T full duplex */
        priv->lp_mode = LPC17_40_100BASET_FD;
        break;

      default:
        nerr("ERROR: Unrecognized mode: %04x\n", phyreg);
        return -ENODEV;
    }

#elif defined(CONFIG_ETH0_PHY_KSZ8081)
  phyreg = lpc17_40_phyread(phyaddr, MII_KSZ8081_PHYCTRL1);

  switch (phyreg & MII_PHYCTRL1_MODE_MASK)
    {
      case MII_PHYCTRL1_MODE_10HDX:  /* 10BASE-T half duplex */
        priv->lp_mode = LPC17_40_10BASET_HD;
        lpc17_40_putreg(0, LPC17_40_ETH_SUPP);
        break;

      case MII_PHYCTRL1_MODE_100HDX: /* 100BASE-T half duplex */
        priv->lp_mode = LPC17_40_100BASET_HD;
        break;

      case MII_PHYCTRL1_MODE_10FDX: /* 10BASE-T full duplex */
        priv->lp_mode = LPC17_40_10BASET_FD;
        lpc17_40_putreg(0, LPC17_40_ETH_SUPP);
        break;

      case MII_PHYCTRL1_MODE_100FDX: /* 100BASE-T full duplex */
        priv->lp_mode = LPC17_40_100BASET_FD;
        break;

      default:
        nerr("ERROR: Unrecognized mode: %04x\n", phyreg);
        return -ENODEV;
    }

#elif defined(CONFIG_ETH0_PHY_DP83848C)
  phyreg = lpc17_40_phyread(phyaddr, MII_DP83848C_STS);

  /* Configure for full/half duplex mode and speed */

  switch (phyreg & 0x0006)
    {
      case 0x0000:
        priv->lp_mode = LPC17_40_100BASET_HD;
        break;

      case 0x0002:
        priv->lp_mode = LPC17_40_10BASET_HD;
        lpc17_40_putreg(0, LPC17_40_ETH_SUPP);
        break;

      case 0x0004:
        priv->lp_mode = LPC17_40_100BASET_FD;
        break;

      case 0x0006:
        priv->lp_mode = LPC17_40_10BASET_FD;
        lpc17_40_putreg(0, LPC17_40_ETH_SUPP);
        break;

      default:
        nerr("ERROR: Unrecognized mode: %04x\n", phyreg);
        return -ENODEV;
    }

#elif defined(CONFIG_ETH0_PHY_LAN8720)
  {
    uint16_t advertise;
    uint16_t lpa;

    up_udelay(500);
    advertise = lpc17_40_phyread(phyaddr, MII_ADVERTISE);
    lpa       = lpc17_40_phyread(phyaddr, MII_LPA);

    /* Check for 100BASETX full duplex */

