apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_ethernet.c
      lpc17_40_putreg(18, LPC17_40_ETH_IPGT);

      /* Set MAC to operate in half duplex mode with CRC and Pad enabled */

      regval = lpc17_40_getreg(LPC17_40_ETH_MAC2);
      regval &= ~ETH_MAC2_FD;
      regval |= (ETH_MAC2_CRCEN | ETH_MAC2_PADCRCEN);
      lpc17_40_putreg(regval, LPC17_40_ETH_MAC2);

      /* Select half duplex operation for ethernet controller */

      regval = lpc17_40_getreg(LPC17_40_ETH_CMD);
      regval &= ~ETH_CMD_FD;
      regval |= (ETH_CMD_RMII | ETH_CMD_PRFRAME);
      lpc17_40_putreg(regval, LPC17_40_ETH_CMD);
    }

  /* This is currently done in lpc17_40_phyinit().  That doesn't
   * seem like the right place. It should be done here.
   */

#if 0
  regval = lpc17_40_getreg(LPC17_40_ETH_SUPP);
  if ((mode & LPC17_40_SPEED_MASK) == LPC17_40_SPEED_100)
    {
      regval |= ETH_SUPP_SPEED;
    }
  else
    {
      regval &= ~ETH_SUPP_SPEED;
    }

  lpc17_40_putreg(regval, LPC17_40_ETH_SUPP);
#endif
}

#else
static inline void lpc17_40_macmode(uint8_t mode)
{
}
#endif

/****************************************************************************
 * Function: lpc17_40_ethreset
 *
 * Description:
 *   Configure and reset the Ethernet module, leaving it in a disabled state.
 *
 * Input Parameters:
 *   priv   - Reference to the driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *
 ****************************************************************************/

static void lpc17_40_ethreset(struct lpc17_40_driver_s *priv)
{
  irqstate_t flags;

  /* Reset the MAC */

  flags = enter_critical_section();

  /* Put the MAC into the reset state */

  lpc17_40_putreg((ETH_MAC1_TXRST    | ETH_MAC1_MCSTXRST | ETH_MAC1_RXRST |
                ETH_MAC1_MCSRXRST | ETH_MAC1_SIMRST   | ETH_MAC1_SOFTRST),
               LPC17_40_ETH_MAC1);

  /* Disable RX/RX, clear modes, reset all control registers */

  lpc17_40_putreg((ETH_CMD_REGRST | ETH_CMD_TXRST | ETH_CMD_RXRST),
               LPC17_40_ETH_CMD);

  /* Take the MAC out of the reset state */

  up_udelay(50);
  lpc17_40_putreg(0, LPC17_40_ETH_MAC1);

  /* The RMII bit must be set on initialization (I'm not sure this needs
   * to be done here but... oh well).
   */

  lpc17_40_putreg(ETH_CMD_RMII, LPC17_40_ETH_CMD);

  /* Set other misc configuration-related registers to default values */

  lpc17_40_putreg(0, LPC17_40_ETH_MAC2);
  lpc17_40_putreg(0, LPC17_40_ETH_SUPP);
  lpc17_40_putreg(0, LPC17_40_ETH_TEST);

  lpc17_40_putreg(18, LPC17_40_ETH_IPGR);
  lpc17_40_putreg(((15 << ETH_CLRT_RMAX_SHIFT) |
                   (55 << ETH_CLRT_COLWIN_SHIFT)), LPC17_40_ETH_CLRT);

  /* Set the Maximum Frame size register. "This field resets to the value
   * 0x0600, which represents a maximum receive frame of 1536 octets. An
   * untagged maximum size Ethernet frame is 1518 octets. A tagged frame adds
   * four octets for a total of 1522 octets. If a shorter maximum length
   * restriction is desired, program this 16-bit field."
   */

  lpc17_40_putreg(LPC17_40_MAXPACKET_SIZE, LPC17_40_ETH_MAXF);

  /* Disable all Ethernet controller interrupts */

  lpc17_40_putreg(0, LPC17_40_ETH_INTEN);

  /* Clear any pending interrupts (shouldn't be any) */

  lpc17_40_putreg(0xffffffff, LPC17_40_ETH_INTCLR);
  leave_critical_section(flags);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Function: lpc17_40_ethinitialize
 *
 * Description:
 *   Initialize one Ethernet controller and driver structure.
 *
 * Input Parameters:
 *   intf - Selects the interface to be initialized.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

#if CONFIG_LPC17_40_NINTERFACES > 1 || defined(CONFIG_NETDEV_LATEINIT)
int lpc17_40_ethinitialize(int intf)
#else
static inline int lpc17_40_ethinitialize(int intf)
#endif
{
  struct lpc17_40_driver_s *priv;
  uint32_t regval;
  int ret;
  int i;

  DEBUGASSERT(intf < CONFIG_LPC17_40_NINTERFACES);
  priv = &g_ethdrvr[intf];

  /* Turn on the ethernet MAC clock */

  regval  = lpc17_40_getreg(LPC17_40_SYSCON_PCONP);
  regval |= SYSCON_PCONP_PCENET;
  lpc17_40_putreg(regval, LPC17_40_SYSCON_PCONP);

  /* Configure all GPIO pins needed by ENET */

  for (i = 0; i < GPIO_NENET_PINS; i++)
    {
      lpc17_40_configgpio(g_enetpins[i]);
    }

  lpc17_40_showpins();

  /* Initialize the driver structure */

  memset(priv, 0, sizeof(struct lpc17_40_driver_s));
  priv->lp_dev.d_buf     = g_pktbuf[intf];     /* Single packet buffer */
  priv->lp_dev.d_ifup    = lpc17_40_ifup;      /* I/F down callback */
  priv->lp_dev.d_ifdown  = lpc17_40_ifdown;    /* I/F up (new IP address) callback */
  priv->lp_dev.d_txavail = lpc17_40_txavail;   /* New TX data callback */
#ifdef CONFIG_NET_MCASTGROUP
  priv->lp_dev.d_addmac  = lpc17_40_addmac;    /* Add multicast MAC address */
  priv->lp_dev.d_rmmac   = lpc17_40_rmmac;     /* Remove multicast MAC address */
#endif
#ifdef CONFIG_NETDEV_IOCTL
  priv->lp_dev.d_ioctl   = lpc17_40_eth_ioctl; /* Handle network IOCTL commands */
#endif
  priv->lp_dev.d_private = priv;               /* Used to recover private state from dev */

#if CONFIG_LPC17_40_NINTERFACES > 1
# error "A mechanism to associate base address an IRQ with an interface is needed"
  priv->lp_base          = ??;                 /* Ethernet controller base address */
  priv->lp_irq           = ??;                 /* Ethernet controller IRQ number */
#endif

  /* Reset the Ethernet controller and leave in the ifdown statue.  The
   * Ethernet controller will be properly re-initialized each time
   * lpc17_40_ifup() is called.
   */

  lpc17_40_ifdown(&priv->lp_dev);

  /* Attach the IRQ to the driver */

#if CONFIG_LPC17_40_NINTERFACES > 1
  ret = irq_attach(priv->irq, lpc17_40_interrupt, NULL);
#else
  ret = irq_attach(LPC17_40_IRQ_ETH, lpc17_40_interrupt, NULL);
#endif
  if (ret != 0)
    {
      /* We could not attach the ISR to the interrupt */

      return -EAGAIN;
    }

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->lp_dev, NET_LL_ETHERNET);
  return OK;
}

/****************************************************************************
 * Name: arm_netinitialize
 *
 * Description:
 *   Initialize the first network interface.  If there are more than one
 *   interface in the chip, then board-specific logic will have to provide
 *   this function to determine which, if any, Ethernet controllers should
 *   be initialized.
 *
 ****************************************************************************/

#if CONFIG_LPC17_40_NINTERFACES == 1 && !defined(CONFIG_NETDEV_LATEINIT)
void arm_netinitialize(void)
{
  lpc17_40_ethinitialize(0);
}
#endif
#endif /* LPC17_40_NETHCONTROLLERS > 0 */
#endif /* CONFIG_NET && CONFIG_LPC17_40_ETHERNET */
